{
  "Aries": "Aries is the first sign of the zodiac, symbolizing birth, beginnings, and raw life force. Ruled by Mars, the planet of action, aggression, and passion, Aries carries an unstoppable forward-moving energy. Aries individuals are characterized by courage, impulsiveness, competitiveness, and an instinctual desire to lead. They thrive in situations that demand quick decisions and bold moves. Their nature is fiery and direct, often making them seem impatient or hot-headed, but underneath lies a fierce loyalty and a protective instinct for those they care about. Aries hates stagnation and tends to initiate new ideas or projects with enthusiasm—though they sometimes struggle with finishing what they start. They are honest to a fault, preferring open confrontation over hidden tension. They carry a warrior spirit, and challenges awaken their determination. Aries energy is youthful, enthusiastic, spontaneous, and often unpredictable.",

  "Taurus": "Taurus is the second sign, symbolizing stability, material security, and the physical world. Ruled by Venus, Taurus is deeply connected to sensual pleasures: touch, taste, beauty, and comfort. Taurus individuals crave consistency, routine, and reliability. They are patient, persistent, and methodical, often taking the slow approach to life but achieving more through long-term determination. Their nature is grounded and practical, valuing comfort, luxury, and emotional peace. While gentle and calm, Taurus has a stubborn streak—once they commit to a belief or decision, they rarely change course. They are strong-willed and resilient in crises. Taurus is deeply loyal in relationships, preferring long-lasting bonds built on trust. They appreciate nature, art, music, and anything that pleases the senses. Taurus energy is nurturing, steady, sensual, and deeply rooted.",

  "Gemini": "Gemini is the sign of communication, intellect, curiosity, and duality. Ruled by Mercury, Gemini individuals possess quick minds, adaptable personalities, and a constant thirst for knowledge. They are excellent conversationalists, socially versatile, and naturally inquisitive. Geminis often juggle multiple interests or hobbies and can shift from one topic to another with ease. Their dual nature makes them both playful and analytical, lighthearted yet capable of deep thought. They thrive in environments that stimulate their intellect and allow them to interact with others. Geminis can sometimes seem inconsistent or hard to read, not because they are deceptive but because they experience multiple perspectives simultaneously. They love learning, exploring ideas, and engaging in witty discussions. Gemini energy is lively, curious, expressive, and ever-changing.",

  "Cancer": "Cancer is the sign of emotion, intuition, home, and protection. Ruled by the Moon, Cancer individuals experience deep emotional cycles and possess a rich inner world. They are nurturing, empathetic, and sensitive to the feelings of others. Family, both biological and chosen, is central to their identity. They have strong memories and may cling to past experiences—both comforting and painful. Cancer’s protective nature can manifest as defensiveness or moodiness when they feel unsafe emotionally. They are natural caregivers who offer love, comfort, and emotional support. Though shy or reserved at first, they form strong attachments and maintain fierce loyalty to those they trust. Cancer energy is intuitive, caring, emotionally deep, and strongly connected to home and roots.",

  "Leo": "Leo represents creativity, self-expression, pride, and leadership. Ruled by the Sun, Leo individuals radiate confidence, charisma, and warmth. They love to be seen, appreciated, and celebrated, but they also bring light and positivity to the people around them. Leos are generous, loyal, protective, and driven by a desire to create something meaningful. They thrive in roles that allow them to shine—whether through performance, leadership, or artistic expression. However, their strong ego may make them sensitive to criticism or overly dramatic at times. At their best, they inspire, uplift, and encourage others. Leos value honesty, loyalty, and respect, expecting the same devotion they offer. Leo energy is bold, passionate, expressive, and radiant.",

  "Virgo": "Virgo symbolizes analysis, service, precision, and self-improvement. Ruled by Mercury, Virgo individuals possess sharp logical minds and a natural ability to organize, analyze, and refine. They notice details others overlook and are often perfectionists. Virgos value efficiency, cleanliness, and order—not just physically but mentally as well. They genuinely want to help others and often take on supportive or problem-solving roles. Virgos may struggle with overthinking, self-criticism, or anxiety due to their desire for perfection. They are humble, practical, and reliable, preferring actions over empty words. Their approach to life is grounded and realistic, yet their inner world is rich with thought and contemplation. Virgo energy is meticulous, thoughtful, helpful, and quietly powerful.",

  "Libra": "Libra is the sign of balance, harmony, beauty, and relationships. Ruled by Venus, Libras seek peace and equality in all interactions. They are skilled diplomats, able to see multiple sides of an issue, and often serve as mediators. Libras dislike conflict and strive to create harmony around them, sometimes at the cost of suppressing their own needs. They have refined aesthetic sense and appreciate art, beauty, and social elegance. Decision-making can be difficult for them because they constantly weigh every option. In relationships, they seek partnership and mutual respect. Libra energy is graceful, fair-minded, charming, and relationship-oriented.",

  "Scorpio": "Scorpio represents intensity, transformation, secrecy, and emotional power. Ruled by Pluto (and traditionally Mars), Scorpio individuals possess deep emotional insight and an ability to perceive hidden truths. They are passionate, mysterious, and determined, often drawn to taboo or psychologically profound topics. Scorpios feel emotions intensely and form deep bonds. Betrayal wounds them deeply, and their trust is hard to earn but fiercely maintained once given. They are protective, loyal, and courageous. Scorpios are masters of transformation, often reinventing themselves throughout life. They understand the darker side of human nature but are also capable of immense empathy and healing. Scorpio energy is powerful, magnetic, secretive, and transformative.",

  "Sagittarius": "Sagittarius is the sign of freedom, exploration, wisdom, and truth. Ruled by Jupiter, Sagittarians possess an adventurous spirit and an endless curiosity about the world. They seek meaning through travel, philosophy, culture, or spiritual exploration. Honest to the point of bluntness, they value authenticity and resist restrictions of any kind. Sagittarians thrive on independence and spontaneity. Their optimism and enthusiasm inspire others, though they may sometimes appear reckless or inconsistent. They love big ideas and future possibilities. Sagittarius energy is expansive, optimistic, adventurous, and truth-seeking.",

  "Capricorn": "Capricorn symbolizes discipline, ambition, responsibility, and long-term achievement. Ruled by Saturn, Capricorn individuals are hardworking, practical, and deeply motivated by long-term goals. They value structure, order, and perseverance. Capricorns often mature early, carrying a serious or focused demeanor, yet they possess a dry wit and surprising emotional depth beneath their calm exterior. They are natural leaders who thrive in positions of authority or strategy. Capricorns can be cautious, guarded, or overly self-critical. They build success through patience and tenacity, often achieving mastery in their chosen field. Capricorn energy is determined, disciplined, wise, and resilient.",

  "Aquarius": "Aquarius is the sign of innovation, independence, intellect, and humanitarian ideals. Ruled by Uranus (and traditionally Saturn), Aquarians think differently from the crowd. They are forward-thinking, original, and drawn to unconventional ideas. They value freedom and personal authenticity, often rebelling against societal expectations. Aquarius individuals care deeply about collective well-being and often advocate for progress, reform, or equality. They may seem emotionally detached, but they form strong intellectual bonds and are loyal to those who understand them. Their minds are analytical, futuristic, and imaginative. Aquarius energy is revolutionary, eccentric, intellectual, and human-centered.",

  "Pisces": "Pisces represents spirituality, imagination, compassion, and emotional depth. Ruled by Neptune (and traditionally Jupiter), Pisces individuals are empathetic, intuitive, and highly sensitive to the energies around them. They have vivid imaginations and strong creative or artistic abilities. Pisces often absorb the feelings of others and may struggle with boundaries. They are compassionate healers, idealists, and dreamers who seek emotional or spiritual connection. Their inner world is vast, and they may escape into fantasy or solitude when overwhelmed. Pisces energy is mystical, empathetic, imaginative, and deeply emotional."
}
